farmart/app/controllers/orders_controller.rb

  def index
    @vendor = Vendor.find(params[:vendor_id])
    @product = Product.find(params[:product_id])
    @orders = @product.orders.order(:created_at)
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."product_id" = $1 ORDER BY "orders"."created_at" ASC  [["product_id", 5]]

  def show
    @vendor = Vendor.find(params[:vendor_id])
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @vendor = Vendor.find(params[:vendor_id])
    @product = Product.find(params[:product_id])
    @order = @product.orders.create!(order_params)
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "orders" ("customer_name", "contact_num", "pick_up_time", "reserve_amount", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @vendor = Vendor.find(params[:vendor_id])
    @product = Product.find(params[:product_id])
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 8]]