farmart/app/controllers/products_controller.rb

  def index
    @vendor = Vendor.find(params[:vendor_id])
    @products = @vendor.products.order(:created_at)
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."vendor_id" = $1 ORDER BY "products"."created_at" ASC  [["vendor_id", 5]]

  def show
    @vendor = Vendor.find(params[:vendor_id])
    @product = Product.find(params[:id])
    @orders = @product.orders.all
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."product_id" = $1  [["product_id", 2]]

  def create
    @vendor = Vendor.find(params[:vendor_id])
    @product = @vendor.products.create!(product_params)
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
INSERT INTO "products" ("category", "name", "amount", "unit_of_measure", "image", "description", "created_at", "updated_at", "vendor_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @vendor = Vendor.find(params[:vendor_id])
    @product = Product.find(params[:id])
    @product.update(product_params)
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "products" SET "description" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["description", "#########"], ["updated_at", 2017-03-15 14:28:19 UTC], ["id", 9]]