farmart/app/controllers/vendors_controller.rb

SELECT "vendors".* FROM "vendors" ORDER BY "vendors"."created_at" ASC
---
  def index
    @vendors = Vendor.all.order(:created_at)

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @vendor = Vendor.find(params[:id])

INSERT INTO "vendors" ("name", "city", "state", "website", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "a"], ["city", "a"], ["state", "a"], ["website", "a"], ["image", "a"], ["created_at", 2017-03-13 15:30:22 UTC], ["updated_at", 2017-03-13 15:30:22 UTC]]
---
  def create
    @vendor = Vendor.new(Vendor_params)
    respond_to do |format|

      if @vendor.save

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "vendors" SET "website" = $1, "updated_at" = $2 WHERE "vendors"."id" = $3  [["website", "#####"], ["updated_at", 2017-03-14 19:56:22 UTC], ["id", 16]]
---
  def update
    @Vendor = Vendor.find(params[:id])
    @Vendor.update(Vendor_params)

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "vendors" WHERE "vendors"."id" = $1  [["id", 5]]
---
  def destroy
    @Vendor = Vendor.find(params[:id])
    @Vendor.destroy